package com.robot.evaluation;

import java.util.HashMap;

public class Const {
	private static final boolean mDebug = true;
	
	private static final HashMap<String, Cases> TotalCasesForTest = new HashMap<String, Cases>() {
		{
			int monthAge = 1;
			while(monthAge <= 84) {
				put("" + monthAge, new Cases(
						new Case("运动智能标题"+monthAge, "运动智能方法"+monthAge, "运动智能标准"+monthAge),
						new Case("艺术智能标题"+monthAge, "艺术智能方法"+monthAge, "艺术智能标准"+monthAge),
						new Case("认知智能标题"+monthAge, "认知智能方法"+monthAge, "认知智能标准"+monthAge),
						new Case("语言智能标题"+monthAge, "语言智能方法"+monthAge, "语言智能标准"+monthAge),
						new Case("情商智能标题"+monthAge, "情商智能方法"+monthAge, "情商智能标准"+monthAge)
					));
				monthAge += (monthAge < 12) ? 1 : 3;
			}
		}
	};
	
	public static HashMap<String, Cases> getCases() {
		return (mDebug) ? TotalCasesForTest : TotalCases;
	}
	
	public static class Cases {
		public Case mMotionCase;
		public Case mArtCase;
		public Case mCognitiveCase;
		public Case mSpeakCase;
		public Case mEQCase;
		
		public Cases(Case t1, Case t2, Case t3, Case t4, Case t5) {
			mMotionCase = t1;
			mArtCase = t2;
			mCognitiveCase = t3;
			mSpeakCase = t4;
			mEQCase = t5;
		}
	}
	
	public static class Case {
		public String mTitle;
		public String mMethod;
		public String mStandard;
		
		public Case(String title, String method, String standard) {
			mTitle = title;
			mMethod = method;
			mStandard = standard;
		}
	}
	
	private static final HashMap<String, Cases> TotalCases = new HashMap<String, Cases>() {
		{
		put("1", new Cases(
			new Case("抱起头竖直2秒",
					"扶宝宝头靠在成人肩上，手放在宝宝脑后但不要扶住头部，让其自然竖直",
					"头能独立竖直2秒"),
			new Case("触碰掌心紧握拳",
					"宝宝仰卧，大人将食指放入宝宝掌中",
					"宝宝能将拳头握紧"),
			new Case("听声音用眼找声源",
					"宝宝仰卧距一侧耳9厘米摇铃",
					"眼睛向声源方向移动"),
			new Case("自发细柔喉音",
					"宝宝仰卧清醒时，观察其发音",
					"能发出除哭以外的任何一种细小柔和的声音"),
			new Case("眼睛跟踪走动的人",
					"宝宝仰卧，大人在宝宝视线内来回走动",
					"眼跟随走动的人转动")
			));
		put("2", new Cases(
			new Case("俯卧抬头离开床面片刻",
					"宝宝趴在床上，脸向下，双臂放在头两侧，前面用摇鼓逗引其抬头",
					"自行抬头，下额离开床面2秒"),
			new Case("拨浪鼓留握2–3秒",
					"将拨浪鼓塞在宝宝手中",
					"能握住拨浪鼓2–3秒"),
			new Case("立刻注意大玩具",
					"宝宝仰卧，用大吹塑玩具在宝宝面前晃动",
					"可立刻看到玩具并注视4–5秒"),
			new Case("发a、o、e等母音",
					"面对宝宝，用丰富的表情和亲切的语言逗引他",
					"会发a、o、e等母音"),
			new Case("逗引时会微笑",
					"宝宝仰卧，用语言、表情逗他，但不要用手触及他",
					"微笑等愉快反应")
		));
		put("3", new Cases(
			new Case("俯卧抬头45度",
					"宝宝仰卧，双手放在头两侧，前面用玩具逗引",
					"可自行抬头离床面，面部与床成45度"),
			new Case("拨浪鼓留握0.5分钟",
					"宝宝仰卧，将拨浪鼓或带细柄的玩具塞入宝宝手中",
					"握住玩具半分钟"),
			new Case("眼跟红球180度",
					"宝宝仰卧距眼20厘米处摇动红球（直径10厘米）引起其注意，然后以每秒78厘米的速度将球移到头的一侧，再由一侧经过中央移向另一侧",
					"眼及头随球转动180度"),
			new Case("笑出声",
					"用玩具或语言逗引宝宝，但不要接触其身体",
					"能发出\"咯咯\"笑声"),
			new Case("见人主动笑",
					"宝宝仰卧，家长站在宝宝面前，不要逗宝宝，观察他的表现",
					"见人能自动微笑、发音或挥手蹬脚、表现出快乐的神情")
		));
		put("4", new Cases(
			new Case("运动智能标题4", "运动智能方法4", "运动智能标准4"),
			new Case("艺术智能标题4", "艺术智能方法4", "艺术智能标准4"),
			new Case("认知智能标题4", "认知智能方法4", "认知智能标准4"),
			new Case("语言智能标题4", "语言智能方法4", "语言智能标准4"),
			new Case("情商智能标题4", "情商智能方法4", "情商智能标准4")
		));
		put("5", new Cases(
			new Case("运动智能标题5", "运动智能方法5", "运动智能标准5"),
			new Case("艺术智能标题5", "艺术智能方法5", "艺术智能标准5"),
			new Case("认知智能标题5", "认知智能方法5", "认知智能标准5"),
			new Case("语言智能标题5", "语言智能方法5", "语言智能标准5"),
			new Case("情商智能标题5", "情商智能方法5", "情商智能标准5")
		));
		put("6", new Cases(
			new Case("运动智能标题6", "运动智能方法6", "运动智能标准6"),
			new Case("艺术智能标题6", "艺术智能方法6", "艺术智能标准6"),
			new Case("认知智能标题6", "认知智能方法6", "认知智能标准6"),
			new Case("语言智能标题6", "语言智能方法6", "语言智能标准6"),
			new Case("情商智能标题6", "情商智能方法6", "情商智能标准6")
		));
		put("7", new Cases(
			new Case("运动智能标题7", "运动智能方法7", "运动智能标准7"),
			new Case("艺术智能标题7", "艺术智能方法7", "艺术智能标准7"),
			new Case("认知智能标题7", "认知智能方法7", "认知智能标准7"),
			new Case("语言智能标题7", "语言智能方法7", "语言智能标准7"),
			new Case("情商智能标题7", "情商智能方法7", "情商智能标准7")
		));
		put("8", new Cases(
			new Case("运动智能标题8", "运动智能方法8", "运动智能标准8"),
			new Case("艺术智能标题8", "艺术智能方法8", "艺术智能标准8"),
			new Case("认知智能标题8", "认知智能方法8", "认知智能标准8"),
			new Case("语言智能标题8", "语言智能方法8", "语言智能标准8"),
			new Case("情商智能标题8", "情商智能方法8", "情商智能标准8")
		));
		put("9", new Cases(
			new Case("运动智能标题9", "运动智能方法9", "运动智能标准9"),
			new Case("艺术智能标题9", "艺术智能方法9", "艺术智能标准9"),
			new Case("认知智能标题9", "认知智能方法9", "认知智能标准9"),
			new Case("语言智能标题9", "语言智能方法9", "语言智能标准9"),
			new Case("情商智能标题9", "情商智能方法9", "情商智能标准9")
		));
		put("10", new Cases(
			new Case("运动智能标题10", "运动智能方法10", "运动智能标准10"),
			new Case("艺术智能标题10", "艺术智能方法10", "艺术智能标准10"),
			new Case("认知智能标题10", "认知智能方法10", "认知智能标准10"),
			new Case("语言智能标题10", "语言智能方法10", "语言智能标准10"),
			new Case("情商智能标题10", "情商智能方法10", "情商智能标准10")
		));
		put("11", new Cases(
			new Case("运动智能标题11", "运动智能方法11", "运动智能标准11"),
			new Case("艺术智能标题11", "艺术智能方法11", "艺术智能标准11"),
			new Case("认知智能标题11", "认知智能方法11", "认知智能标准11"),
			new Case("语言智能标题11", "语言智能方法11", "语言智能标准11"),
			new Case("情商智能标题11", "情商智能方法11", "情商智能标准11")
		));
		put("12", new Cases(
			new Case("运动智能标题12", "运动智能方法12", "运动智能标准12"),
			new Case("艺术智能标题12", "艺术智能方法12", "艺术智能标准12"),
			new Case("认知智能标题12", "认知智能方法12", "认知智能标准12"),
			new Case("语言智能标题12", "语言智能方法12", "语言智能标准12"),
			new Case("情商智能标题12", "情商智能方法12", "情商智能标准12")
		));
		put("15", new Cases(
			new Case("运动智能标题15", "运动智能方法15", "运动智能标准15"),
			new Case("艺术智能标题15", "艺术智能方法15", "艺术智能标准15"),
			new Case("认知智能标题15", "认知智能方法15", "认知智能标准15"),
			new Case("语言智能标题15", "语言智能方法15", "语言智能标准15"),
			new Case("情商智能标题15", "情商智能方法15", "情商智能标准15")
		));
		put("18", new Cases(
			new Case("运动智能标题18", "运动智能方法18", "运动智能标准18"),
			new Case("艺术智能标题18", "艺术智能方法18", "艺术智能标准18"),
			new Case("认知智能标题18", "认知智能方法18", "认知智能标准18"),
			new Case("语言智能标题18", "语言智能方法18", "语言智能标准18"),
			new Case("情商智能标题18", "情商智能方法18", "情商智能标准18")
		));
		put("21", new Cases(
			new Case("运动智能标题21", "运动智能方法21", "运动智能标准21"),
			new Case("艺术智能标题21", "艺术智能方法21", "艺术智能标准21"),
			new Case("认知智能标题21", "认知智能方法21", "认知智能标准21"),
			new Case("语言智能标题21", "语言智能方法21", "语言智能标准21"),
			new Case("情商智能标题21", "情商智能方法21", "情商智能标准21")
		));
		put("24", new Cases(
			new Case("运动智能标题24", "运动智能方法24", "运动智能标准24"),
			new Case("艺术智能标题24", "艺术智能方法24", "艺术智能标准24"),
			new Case("认知智能标题24", "认知智能方法24", "认知智能标准24"),
			new Case("语言智能标题24", "语言智能方法24", "语言智能标准24"),
			new Case("情商智能标题24", "情商智能方法24", "情商智能标准24")
		));
		put("27", new Cases(
			new Case("运动智能标题27", "运动智能方法27", "运动智能标准27"),
			new Case("艺术智能标题27", "艺术智能方法27", "艺术智能标准27"),
			new Case("认知智能标题27", "认知智能方法27", "认知智能标准27"),
			new Case("语言智能标题27", "语言智能方法27", "语言智能标准27"),
			new Case("情商智能标题27", "情商智能方法27", "情商智能标准27")
		));
		put("30", new Cases(
			new Case("运动智能标题30", "运动智能方法30", "运动智能标准30"),
			new Case("艺术智能标题30", "艺术智能方法30", "艺术智能标准30"),
			new Case("认知智能标题30", "认知智能方法30", "认知智能标准30"),
			new Case("语言智能标题30", "语言智能方法30", "语言智能标准30"),
			new Case("情商智能标题30", "情商智能方法30", "情商智能标准30")
		));
		put("33", new Cases(
			new Case("运动智能标题33", "运动智能方法33", "运动智能标准33"),
			new Case("艺术智能标题33", "艺术智能方法33", "艺术智能标准33"),
			new Case("认知智能标题33", "认知智能方法33", "认知智能标准33"),
			new Case("语言智能标题33", "语言智能方法33", "语言智能标准33"),
			new Case("情商智能标题33", "情商智能方法33", "情商智能标准33")
		));
		put("36", new Cases(
			new Case("运动智能标题36", "运动智能方法36", "运动智能标准36"),
			new Case("艺术智能标题36", "艺术智能方法36", "艺术智能标准36"),
			new Case("认知智能标题36", "认知智能方法36", "认知智能标准36"),
			new Case("语言智能标题36", "语言智能方法36", "语言智能标准36"),
			new Case("情商智能标题36", "情商智能方法36", "情商智能标准36")
		));
		put("39", new Cases(
			new Case("运动智能标题39", "运动智能方法39", "运动智能标准39"),
			new Case("艺术智能标题39", "艺术智能方法39", "艺术智能标准39"),
			new Case("认知智能标题39", "认知智能方法39", "认知智能标准39"),
			new Case("语言智能标题39", "语言智能方法39", "语言智能标准39"),
			new Case("情商智能标题39", "情商智能方法39", "情商智能标准39")
		));
		put("42", new Cases(
			new Case("运动智能标题42", "运动智能方法42", "运动智能标准42"),
			new Case("艺术智能标题42", "艺术智能方法42", "艺术智能标准42"),
			new Case("认知智能标题42", "认知智能方法42", "认知智能标准42"),
			new Case("语言智能标题42", "语言智能方法42", "语言智能标准42"),
			new Case("情商智能标题42", "情商智能方法42", "情商智能标准42")
		));
		put("45", new Cases(
			new Case("运动智能标题45", "运动智能方法45", "运动智能标准45"),
			new Case("艺术智能标题45", "艺术智能方法45", "艺术智能标准45"),
			new Case("认知智能标题45", "认知智能方法45", "认知智能标准45"),
			new Case("语言智能标题45", "语言智能方法45", "语言智能标准45"),
			new Case("情商智能标题45", "情商智能方法45", "情商智能标准45")
		));
		put("48", new Cases(
			new Case("运动智能标题48", "运动智能方法48", "运动智能标准48"),
			new Case("艺术智能标题48", "艺术智能方法48", "艺术智能标准48"),
			new Case("认知智能标题48", "认知智能方法48", "认知智能标准48"),
			new Case("语言智能标题48", "语言智能方法48", "语言智能标准48"),
			new Case("情商智能标题48", "情商智能方法48", "情商智能标准48")
		));
		put("51", new Cases(
			new Case("运动智能标题51", "运动智能方法51", "运动智能标准51"),
			new Case("艺术智能标题51", "艺术智能方法51", "艺术智能标准51"),
			new Case("认知智能标题51", "认知智能方法51", "认知智能标准51"),
			new Case("语言智能标题51", "语言智能方法51", "语言智能标准51"),
			new Case("情商智能标题51", "情商智能方法51", "情商智能标准51")
		));
		put("54", new Cases(
			new Case("运动智能标题54", "运动智能方法54", "运动智能标准54"),
			new Case("艺术智能标题54", "艺术智能方法54", "艺术智能标准54"),
			new Case("认知智能标题54", "认知智能方法54", "认知智能标准54"),
			new Case("语言智能标题54", "语言智能方法54", "语言智能标准54"),
			new Case("情商智能标题54", "情商智能方法54", "情商智能标准54")
		));
		put("57", new Cases(
			new Case("运动智能标题57", "运动智能方法57", "运动智能标准57"),
			new Case("艺术智能标题57", "艺术智能方法57", "艺术智能标准57"),
			new Case("认知智能标题57", "认知智能方法57", "认知智能标准57"),
			new Case("语言智能标题57", "语言智能方法57", "语言智能标准57"),
			new Case("情商智能标题57", "情商智能方法57", "情商智能标准57")
		));
		put("60", new Cases(
			new Case("运动智能标题60", "运动智能方法60", "运动智能标准60"),
			new Case("艺术智能标题60", "艺术智能方法60", "艺术智能标准60"),
			new Case("认知智能标题60", "认知智能方法60", "认知智能标准60"),
			new Case("语言智能标题60", "语言智能方法60", "语言智能标准60"),
			new Case("情商智能标题60", "情商智能方法60", "情商智能标准60")
		));
		put("63", new Cases(
			new Case("运动智能标题63", "运动智能方法63", "运动智能标准63"),
			new Case("艺术智能标题63", "艺术智能方法63", "艺术智能标准63"),
			new Case("认知智能标题63", "认知智能方法63", "认知智能标准63"),
			new Case("语言智能标题63", "语言智能方法63", "语言智能标准63"),
			new Case("情商智能标题63", "情商智能方法63", "情商智能标准63")
		));
		put("66", new Cases(
			new Case("运动智能标题66", "运动智能方法66", "运动智能标准66"),
			new Case("艺术智能标题66", "艺术智能方法66", "艺术智能标准66"),
			new Case("认知智能标题66", "认知智能方法66", "认知智能标准66"),
			new Case("语言智能标题66", "语言智能方法66", "语言智能标准66"),
			new Case("情商智能标题66", "情商智能方法66", "情商智能标准66")
		));
		put("69", new Cases(
			new Case("运动智能标题69", "运动智能方法69", "运动智能标准69"),
			new Case("艺术智能标题69", "艺术智能方法69", "艺术智能标准69"),
			new Case("认知智能标题69", "认知智能方法69", "认知智能标准69"),
			new Case("语言智能标题69", "语言智能方法69", "语言智能标准69"),
			new Case("情商智能标题69", "情商智能方法69", "情商智能标准69")
		));
		put("72", new Cases(
			new Case("运动智能标题72", "运动智能方法72", "运动智能标准72"),
			new Case("艺术智能标题72", "艺术智能方法72", "艺术智能标准72"),
			new Case("认知智能标题72", "认知智能方法72", "认知智能标准72"),
			new Case("语言智能标题72", "语言智能方法72", "语言智能标准72"),
			new Case("情商智能标题72", "情商智能方法72", "情商智能标准72")
		));
		put("75", new Cases(
			new Case("运动智能标题75", "运动智能方法75", "运动智能标准75"),
			new Case("艺术智能标题75", "艺术智能方法75", "艺术智能标准75"),
			new Case("认知智能标题75", "认知智能方法75", "认知智能标准75"),
			new Case("语言智能标题75", "语言智能方法75", "语言智能标准75"),
			new Case("情商智能标题75", "情商智能方法75", "情商智能标准75")
		));
		put("78", new Cases(
			new Case("运动智能标题78", "运动智能方法78", "运动智能标准78"),
			new Case("艺术智能标题78", "艺术智能方法78", "艺术智能标准78"),
			new Case("认知智能标题78", "认知智能方法78", "认知智能标准78"),
			new Case("语言智能标题78", "语言智能方法78", "语言智能标准78"),
			new Case("情商智能标题78", "情商智能方法78", "情商智能标准78")
		));
		put("81", new Cases(
			new Case("运动智能标题81", "运动智能方法81", "运动智能标准81"),
			new Case("艺术智能标题81", "艺术智能方法81", "艺术智能标准81"),
			new Case("认知智能标题81", "认知智能方法81", "认知智能标准81"),
			new Case("语言智能标题81", "语言智能方法81", "语言智能标准81"),
			new Case("情商智能标题81", "情商智能方法81", "情商智能标准81")
		));
		put("84", new Cases(
			new Case("运动智能标题84", "运动智能方法84", "运动智能标准84"),
			new Case("艺术智能标题84", "艺术智能方法84", "艺术智能标准84"),
			new Case("认知智能标题84", "认知智能方法84", "认知智能标准84"),
			new Case("语言智能标题84", "语言智能方法84", "语言智能标准84"),
			new Case("情商智能标题84", "情商智能方法84", "情商智能标准84")
		));
		}
	};
}
